Конфигурация/Catalogs/ЭкземплярыОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ЭкземплярыОтчетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отчеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПредоставленияОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретОбработки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВерсииОтчетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВерсии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрольнаяСумма</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>90</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПриСохранении</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Окончательная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Актуальная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Enums/ПериодичностьПредоставленияОтчетности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ПериодичностьПредоставленияОтчетности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ежедневно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Еженедельно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДваРазаВМесяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ежемесячно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ежеквартально</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ежегодно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДекадам</Name>
					<Comment>с 1 по 10, с 11 по 20, с 21 до конца месяца</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Catalogs/ЭкземплярыОтчетов/Ext/ManagerModule.bsl
#Область Интерфейс

// Возвращает выборку с итогами, содержащую список созданных экземпляров отчетов за период с учетом отбора
// Параметры:
//	- Отбор	- структура, содержащая параметры отбора
//		возможные элементы структуры:
//			- Организация	- организация, которой принадлежат отчеты
//			- ГруппаОтчетов	- группа отчетов, отчеты которой нужно получить
//			- Клиенты		- список клиентов, по которым нужно получить отчеты
//			- ВидыДоговоров	- список видов договоров, по которым нужно получить отчеты
//			- Договоры		- список договоров ДУ, по которым нужно получить отчеты
//			- Отчеты		- список отчетов, которые нужно получить отчеты
//			- Периодиночть	- периодичность, отчеты с которой нужно получить
//			- НачалоПериода	- начало периода, за который нужно получить отчеты
//			- КонецПериода	- конец периода, за который нужно получить отчеты
//
Функция ПолучитьОтчетыЗаПериод(Отбор) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация",			?(Отбор.Свойство("Организация"),	Отбор.Организация,		Неопределено));
	Запрос.УстановитьПараметр("ОтборПоГруппеОтчетов",	Отбор.Свойство("ГруппаОтчетов"));
	Запрос.УстановитьПараметр("ГруппаОтчетов",			?(Отбор.Свойство("ГруппаОтчетов"),	Отбор.ГруппаОтчетов,	Неопределено));
	Запрос.УстановитьПараметр("ОтборПоКлиентам",		Отбор.Свойство("Клиенты"));
	Запрос.УстановитьПараметр("Клиенты",				?(Отбор.Свойство("Клиенты"),		Отбор.Клиенты,			Неопределено));
	Запрос.УстановитьПараметр("ОтборПоВидамДоговоров",	Отбор.Свойство("ВидыДоговоров"));
	Запрос.УстановитьПараметр("ВидыДоговоров",			?(Отбор.Свойство("ВидыДоговоров"),	Отбор.ВидыДоговоров,	Неопределено));
	Запрос.УстановитьПараметр("ОтборПоДоговорам",		Отбор.Свойство("Договоры"));
	Запрос.УстановитьПараметр("Договоры",				?(Отбор.Свойство("Договоры"),		Отбор.Договоры,			Неопределено));
	Запрос.УстановитьПараметр("ОтборПоОтчетам",			Отбор.Свойство("Отчеты"));
	Запрос.УстановитьПараметр("Отчеты",					?(Отбор.Свойство("Отчеты"),			Отбор.Отчеты,			Неопределено));
	Запрос.УстановитьПараметр("ОтборПоПериодичности",	Отбор.Свойство("Периодичность"));
	Запрос.УстановитьПараметр("Периодичность",			?(Отбор.Свойство("Периодичность"),	Отбор.Периодичность,	Неопределено));
	Запрос.УстановитьПараметр("ОтборПоНачалуПериода",	Отбор.Свойство("НачалоПериода"));
	Запрос.УстановитьПараметр("НачалоПериода",			?(Отбор.Свойство("НачалоПериода"),	Отбор.НачалоПериода,	Неопределено));
	Запрос.УстановитьПараметр("ОтборПоКонцуПериода",	Отбор.Свойство("КонецПериода"));
	Запрос.УстановитьПараметр("КонецПериода",			?(Отбор.Свойство("КонецПериода"),	Отбор.КонецПериода,		Неопределено));
	
	
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПериодичностьПредоставленияОтчетности.Ссылка КАК Периодичность,
		|	ВЫБОР
		|		КОГДА ПериодичностьПредоставленияОтчетности.Ссылка = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПредоставленияОтчетности.Ежегодно)
		|			ТОГДА 1
		|		КОГДА ПериодичностьПредоставленияОтчетности.Ссылка = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПредоставленияОтчетности.Ежеквартально)
		|			ТОГДА 2
		|		КОГДА ПериодичностьПредоставленияОтчетности.Ссылка = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПредоставленияОтчетности.Ежемесячно)
		|			ТОГДА 3
		|		КОГДА ПериодичностьПредоставленияОтчетности.Ссылка = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПредоставленияОтчетности.ДваРазаВМесяц)
		|			ТОГДА 4
		|		КОГДА ПериодичностьПредоставленияОтчетности.Ссылка = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПредоставленияОтчетности.ПоДекадам)
		|			ТОГДА 5
		|		КОГДА ПериодичностьПредоставленияОтчетности.Ссылка = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПредоставленияОтчетности.Еженедельно)
		|			ТОГДА 6
		|		КОГДА ПериодичностьПредоставленияОтчетности.Ссылка = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПредоставленияОтчетности.Ежедневно)
		|			ТОГДА 7
		|	КОНЕЦ КАК ПорядокПоПериодичности
		|ПОМЕСТИТЬ _ПорядокПериодичности
		|ИЗ
		|	Перечисление.ПериодичностьПредоставленияОтчетности КАК ПериодичностьПредоставленияОтчетности
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ОтборПоПериодичности
		|				ТОГДА ПериодичностьПредоставленияОтчетности.Ссылка = &Периодичность
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправления.Период КАК Период,
		|	КлиентыДоверительногоУправления.Клиент КАК Клиент,
		|	КлиентыДоверительногоУправления.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговора,
		|	КлиентыДоверительногоУправления.СчетДоверительногоУправления КАК Договор
		|ПОМЕСТИТЬ _ПринадлежностьДоговоровКлиентам
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления КАК КлиентыДоверительногоУправления
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &Организация <> НЕОПРЕДЕЛЕНО
		|				ТОГДА КлиентыДоверительногоУправления.Организация = &Организация
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ОтборПоКлиентам
		|				ТОГДА КлиентыДоверительногоУправления.Клиент В (&Клиенты)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ОтборПоВидамДоговоров
		|				ТОГДА КлиентыДоверительногоУправления.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления В (&ВидыДоговоров)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ОтборПоДоговорам
		|				ТОГДА КлиентыДоверительногоУправления.СчетДоверительногоУправления В (&Договоры)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПринадлежностьДоговоровКлиентам.Клиент КАК Клиент,
		|	_ПринадлежностьДоговоровКлиентам.ВидДоговора КАК ВидДоговора,
		|	_ПринадлежностьДоговоровКлиентам.Договор КАК Договор,
		|	_ПринадлежностьДоговоровКлиентам.Период КАК НачалоПериода,
		|	МИНИМУМ(ЕСТЬNULL(_ПринадлежностьДоговоровКлиентам1.Период, ДАТАВРЕМЯ(1, 1, 1))) КАК КонецПериода
		|ПОМЕСТИТЬ _ПериодыПринадлежностиКлиентам
		|ИЗ
		|	_ПринадлежностьДоговоровКлиентам КАК _ПринадлежностьДоговоровКлиентам
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПринадлежностьДоговоровКлиентам КАК _ПринадлежностьДоговоровКлиентам1
		|		ПО _ПринадлежностьДоговоровКлиентам.Договор = _ПринадлежностьДоговоровКлиентам1.Договор
		|			И _ПринадлежностьДоговоровКлиентам.Период < _ПринадлежностьДоговоровКлиентам1.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	_ПринадлежностьДоговоровКлиентам.Период,
		|	_ПринадлежностьДоговоровКлиентам.Клиент,
		|	_ПринадлежностьДоговоровКлиентам.ВидДоговора,
		|	_ПринадлежностьДоговоровКлиентам.Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПериодыПринадлежностиКлиентам.Клиент КАК Клиент,
		|	_ПериодыПринадлежностиКлиентам.ВидДоговора КАК ВидДоговора,
		|	_ПериодыПринадлежностиКлиентам.Договор КАК Договор,
		|	_ПериодыПринадлежностиКлиентам.Договор.НомерДоговора КАК НомерДоговора,
		|	ГОД(ЭкземплярыОтчетов.Дата) КАК Год,
		|	МЕСЯЦ(ЭкземплярыОтчетов.Дата) КАК Месяц,
		|	ВЫБОР
		|		КОГДА ЭкземплярыОтчетов.Отчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.Отчеты.Бухгалтерия))
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Отчеты.Бухгалтерия)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Отчеты.БэкОфис)
		|	КОНЕЦ КАК ГруппаОтчетов,
		|	ЭкземплярыОтчетов.Периодичность КАК Периодичность,
		|	ЭкземплярыОтчетов.Отчет КАК Отчет,
		|	ЭкземплярыОтчетов.Дата КАК Дата,
		|	ЭкземплярыОтчетов.Ссылка КАК Экземпляр,
		|	ЭкземплярыОтчетов.ЗапретОбработки КАК ЗапретОбработки,
		|	_ПорядокПериодичности.ПорядокПоПериодичности КАК ПорядокПоПериодичности
		|ИЗ
		|	Справочник.ЭкземплярыОтчетов КАК ЭкземплярыОтчетов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ПорядокПериодичности КАК _ПорядокПериодичности
		|		ПО ЭкземплярыОтчетов.Периодичность = _ПорядокПериодичности.Периодичность
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ПериодыПринадлежностиКлиентам КАК _ПериодыПринадлежностиКлиентам
		|		ПО ЭкземплярыОтчетов.Субъект = _ПериодыПринадлежностиКлиентам.Договор
		|			И ЭкземплярыОтчетов.Дата >= _ПериодыПринадлежностиКлиентам.НачалоПериода
		|			И (_ПериодыПринадлежностиКлиентам.КонецПериода = ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ ЭкземплярыОтчетов.Дата <= _ПериодыПринадлежностиКлиентам.КонецПериода)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &Организация <> НЕОПРЕДЕЛЕНО
		|				ТОГДА ЭкземплярыОтчетов.Организация = &Организация
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ОтборПоГруппеОтчетов
		|				ТОГДА ЭкземплярыОтчетов.Отчет В ИЕРАРХИИ (&ГруппаОтчетов)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ОтборПоОтчетам
		|				ТОГДА ЭкземплярыОтчетов.Отчет В (&Отчеты)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ОтборПоНачалуПериода
		|				ТОГДА ЭкземплярыОтчетов.Дата >= &НачалоПериода
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ОтборПоНачалуПериода
		|					И &КонецПериода <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ЭкземплярыОтчетов.Дата <= &КонецПериода
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И НЕ ЭкземплярыОтчетов.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Клиент,
		|	ВидДоговора,
		|	Договор,
		|	ГруппаОтчетов,
		|	Год,
		|	Месяц,
		|	ПорядокПоПериодичности,
		|	Дата,
		|	Отчет
		|ИТОГИ ПО
		|	Клиент,
		|	ВидДоговора,
		|	Договор,
		|	ГруппаОтчетов,
		|	Год,
		|	Месяц,
		|	Периодичность";
	#КонецОбласти
	
	Результат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Отчет");
	Поля.Добавить("Периодичность");
	Поля.Добавить("Субъект");
	Поля.Добавить("Дата");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = СтрШаблон("%1 (%2) по %3 за %4", Данные.Отчет, Данные.Периодичность, Данные.Субъект, Формат(Данные.Дата, "ДФ=dd.MM.yyyy"));
	
КонецПроцедуры

#КонецОбласти
